Revit 2027 API
BalusterInfo.DistanceFromPreviousOrSpace Property
 The length, in case of balusters, it is a distance from a previous one. For a post, it is a space from the original position of the post.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double DistanceFromPreviousOrSpace { get; set; }
Public Property DistanceFromPreviousOrSpace As Double
	Get
	Set
public:
property double DistanceFromPreviousOrSpace {
	double get ();
	void set (double value);
}
member DistanceFromPreviousOrSpace : float with get, set
Property Value
Double
Exceptions
Exception | Condition
ArgumentException |  When setting this property: The given value for distanceFromPreviousOrSpace is not finite
ArgumentOutOfRangeException |  When setting this property: The given value for distanceFromPreviousOrSpace must be greater than 0 and no more than 30000 feet.
See Also
Reference
BalusterInfo Class
Autodesk.Revit.DB.Architecture Namespace